Revit 2024 API
PhotometricWebLightDistribution Class
 This class encapsulates a photometric web light distribution.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class PhotometricWebLightDistribution : LightDistribution
Visual Basic
Public Class PhotometricWebLightDistribution _
	Inherits LightDistribution
Visual C++
public ref class PhotometricWebLightDistribution : public LightDistribution
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution
See Also
PhotometricWebLightDistribution Members
Autodesk.Revit.DB.Lighting Namespace